TimeLog.JavaScript.SDK/RequestTemplates/TryAuthenticate.txt

<!--------------- REQUEST ------------------->

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <VsDebuggerCausalityData xmlns="http://schemas.microsoft.com/vstudio/diagnostics/servicemodelsink">uIDPo4kk93S4IAxGgGpyetHt6DIAAAAAQm0bjbJY+ECCx8FG2waf02jfsMff2xRBlGCUFnNF3/UACQAA</VsDebuggerCausalityData>
  </s:Header>
  <s:Body>
    <GetToken xmlns="http://www.timelog.com/api/tlp/v1_2">
      <user>sox</user>
      <password></password>
    </GetToken>
  </s:Body>
</s:Envelope>

<!--------------- RESPONSE ------------------->

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header />
  <s:Body>
    <GetTokenResponse xmlns="http://www.timelog.com/api/tlp/v1_2">
      <GetTokenResult xmlns:a="http://www.timelog.com/api/tlp/v1_1" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:Return>
          <SecurityToken>
            <Initials>sox</Initials>
            <Expires>2015-05-19T23:04:27.4056048+02:00</Expires>
            <Hash>i/HVuTHHvtBcQpBpeuvl9brMeks25BNRGNFhPd+HGeA4Vraj21g4Oi6t7mG2pfHaw8mYnDL+l4QPwImk9lrkiw==</Hash>
          </SecurityToken>
        </a:Return>
        <a:ReturnTypeDescription>SecurityToken</a:ReturnTypeDescription>
        <a:Request>
          <a:Parameters>
            <a:RequestParameter>
              <a:Name>user</a:Name>
              <a:Value>sox</a:Value>
            </a:RequestParameter>
            <a:RequestParameter>
              <a:Name>password</a:Name>
              <a:Value>sox</a:Value>
            </a:RequestParameter>
          </a:Parameters>
          <a:ServiceClass>SecurityService</a:ServiceClass>
          <a:MethodName>GetToken</a:MethodName>
        </a:Request>
        <a:ResponseState>Success</a:ResponseState>
        <a:Messages>
          <a:APIMessage>
            <a:Message>Duration of call was 4,0593935 sec.</a:Message>
            <a:Severity>Message</a:Severity>
            <a:ErrorCode>0</a:ErrorCode>
          </a:APIMessage>
        </a:Messages>
        <a:ErrorCode>0</a:ErrorCode>
      </GetTokenResult>
    </GetTokenResponse>
  </s:Body>
</s:Envelope>